var recognition = new webkitSpeechRecognition();
recognition.lang = 'th-TH'

recognition.onresult = function (event) {
    var text = event.results[0][0].transcript;
    var output = document.getElementById("output").innerHTML = text;

    read(text);
}

function read(text) {
    var speech = new SpeechSynthesisUtterance();
    speech.text = text;

    // speech.lang = "th-TH";
    // speech.text = "สบายดี";

    // speech.lang = "en-US";
    // speech.text = "Hello";


    //ข้อความทักทาย
    if (text == 'Hello') {
        speech.lang = "th-TH";
        speech.text = "สบายดี";
    }
    else if (text == "what is your name") {
        speech.lang = "en-US";
        speech.text = "my name is me tour mice";
    }
    else if (text == "ชื่ออะไรคะ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะ น้องชื่อน้องมีทัวร์ ยินดีที่ได้รู้จักนะคะ";
    }
    else if (text == "Happy New Year") {
        speech.lang = "en-US";
        speech.text = "happy new year ka";
    }
    else if (text == "สวัสดีปีใหม่ค่ะ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีปีใหม่ค่า น้องมีทัวร์ขอให้ปีนี้เป็นปีที่ดีของคุณลูกค้านะคะ";
    }
    else if (text == "อยากไปเที่ยวจังเลยค่า") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะไปเที่ยวกับน้องมีทัวร์ได้นะคะ";
    }
    else if (text == "อยากไปเที่ยวจังเลย") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะไปเที่ยวกับน้องมีทัวร์ได้นะคะ";
    }
    else if (text == "อยากไปเที่ยวจังเลยครับ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะไปเที่ยวกับน้องมีทัวร์ได้นะคะ";
    }
    else if (text == "ฮัลโหล") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "ฮัลโหลค่า") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "ฮัลโหลครับ") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "หวัดดีน้องมีทัวร์") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะให้น้องมีทัวร์ช่วยเหลืออะไรดีคะ";
    }
    else if (text == "ฮัลโหลน้องมีทัวร์") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะให้น้องมีทัวร์ช่วยเหลืออะไรดีคะ";
    }
    else if (text == "มีเจ้าหน้าที่อยู่ไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะให้น้องมีทัวร์ช่วยเหลืออะไรดีคะ";
    }
    else if (text == "มีเจ้าหน้าที่อยู่ไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะให้น้องมีทัวร์ช่วยเหลืออะไรดีคะ";
    }
    else if (text == "มีเจ้าหน้าที่อยู่มั้ยคะ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะให้น้องมีทัวร์ช่วยเหลืออะไรดีคะ";
    }
    else if (text == "มีเจ้าหน้าที่อยู่มั้ยครับ") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะให้น้องมีทัวร์ช่วยเหลืออะไรดีคะ";
    }
    else if (text == "สวัสดีตอนเช้า") {
        speech.lang = "th-TH";
        speech.text = "สวัสดีค่ะ คุณลูกค้า";
    }
    else if (text == "ดี") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "สวัสดี") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "สวัสดีค่ะ") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "สวัสดีค่า") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "สวัสดีครับ") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "ฮัลโหลค่ะ") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "ฮัลโหลค่า") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "ฮัลโหลฮัลโหล") {
        speech.lang = "th-TH";
        speech.text = "ดีจ่ะ สบายดีมั้ยคะ";
    }
    else if (text == "น้องมีทัวร์") {
        speech.lang = "th-TH";
        speech.text = "มีอะไรให้น้องมีทัวร์ช่วยไหมคะ";
    }
    else if (text == "มีทัวร์") {
        speech.lang = "th-TH";
        speech.text = "มีอะไรให้น้องมีทัวร์ช่วยไหมคะ";
    }
    else if (text == "น้องมีถั่วมั้ย") {
        speech.lang = "th-TH";
        speech.text = "มีอะไรให้น้องมีทัวร์ช่วยไหมคะ";
    }
    else if (text == "อยากจองตั๋ว") {
        speech.lang = "th-TH";
        speech.text = "บริการนี้ยังไม่มีนะคะคุณลูกค้า";
    }
    
    //ที่อยู่บริษัท
    else if (text == "ที่อยู่ของบริษัทอยู่ที่ไหน") {
        speech.lang = "th-TH";
        speech.text = "โครงการเวิร์ฟ พระราม9 เปิดทำการทุกวัน ตั้งแต่6.00-24.00น.";
    }
    else if (text == "บริษัทอยู่ที่ไหน") {
        speech.lang = "th-TH";
        speech.text = "โครงการเวิร์ฟ พระราม9 เปิดทำการทุกวัน ตั้งแต่6.00-24.00น.";
    }
    else if (text == "บริษัทอยู่ที่ไหนหรอคะ") {
        speech.lang = "th-TH";
        speech.text = "โครงการเวิร์ฟ พระราม9 เปิดทำการทุกวัน ตั้งแต่6.00-24.00น.";
    }
    else if (text == "บริษัทอยู่ที่ไหนหรอครับ") {
        speech.lang = "th-TH";
        speech.text = "โครงการเวิร์ฟ พระราม9 เปิดทำการทุกวัน ตั้งแต่6.00-24.00น.";
    }
    
    //รับทำวีซ่าไหม
    else if (text == "อยากทำวีซ่าจัง") {
        speech.lang = "th-TH";
        speech.text = "ได้ค่ะคุณลูกค้าสนใจทำวีซ่าประเทศไหนดีคะ";
    }
    else if (text == "จองคิวการทำวีซ่าได้ไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "ได้ค่ะคุณลูกค้า คุณลูกค้าสามารถเข้าไปใช้บริการบนไลน์แชทบอทได้เลยนะคะ";
    }
    else if (text == "วีซ่า") {
        speech.lang = "th-TH";
        speech.text = "คุณลูกค้าต้องการสอบถามเรื่องอะไรเกี่ยวกับวีซ่าคะ";
    }
    else if (text == "สอบถามเรื่องวีซ่า") {
        speech.lang = "th-TH";
        speech.text = "ได้ค่ะคุณลูกค้าสอบถามเรื่องไหนดีคะ";
    }
    else if (text == "สอบถามเรื่องวีซ่าหน่อยคะ") {
        speech.lang = "th-TH";
        speech.text = "ได้ค่ะคุณลูกค้าสอบถามเรื่องไหนดีคะ";
    }
    else if (text == "สอบถามเรื่องวีซ่าค่ะ") {
        speech.lang = "th-TH";
        speech.text = "ได้ค่ะคุณลูกค้าสอบถามเรื่องไหนดีคะ";
    }
    else if (text == "สอบถามเรื่องวีซ่าครับ") {
        speech.lang = "th-TH";
        speech.text = "ได้ค่ะคุณลูกค้าสอบถามเรื่องไหนดีคะ";
    }
    else if (text == "อันนี้รับทำวีซ่าไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "ใช่ค่ะคุณลูกค้า คุณลูกค้าสนใจทำวีซ่าประเทศไหนคะ";
    }
    else if (text == "อันนี้รับทำวีซ่าไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "ใช่ค่ะคุณลูกค้า คุณลูกค้าสนใจทำวีซ่าประเทศไหนดีคะ";
    }
    else if (text == "อันนี้รับทำวีซ่าใช่ไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "ใช่ค่ะคุณลูกค้า สนใจประเทศไหนคะ";
    }
    else if (text == "อันนี้รับทำวีซ่าใช่ไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "ใช่ค่ะคุณลูกค้า คุณลูกค้าสนใจทำวีซ่าประเทศไหนคะบอกน้องมีทัวร์ได้เลยค่ะ";
    }
    else if (text == "รับทำวีซ่าไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "รับค่ะคุณลูกค้า คุณลูกค้าสนใจทำวีซ่าประเทศไหนคะบอกน้องมีทัวร์ได้เลยค่ะ";
    }
    else if (text == "รับทำวีซ่าไหม") {
        speech.lang = "th-TH";
        speech.text = "รับค่ะคุณลูกค้า คุณลูกค้าสนใจทำวีซ่าประเทศไหนคะบอกน้องมีทัวร์ได้เลยค่ะ";
    }
    else if (text == "ทำวีซ่าไหม") {
        speech.lang = "th-TH";
        speech.text = "รับทำค่ะคุณลูกค้า สนใจทำวีซ่าประเทศไหนบอกน้องมีทัวร์ได้นะคะ";
    }
    else if (text == "ทำวีซ่าไหมค่ะ") {
        speech.lang = "th-TH";
        speech.text = "รับทำค่ะคุณลูกค้า สนใจทำวีซ่าประเทศไหนบอกน้องมีทัวร์ได้นะคะ";
    }
    else if (text == "รับทำวีซ่ามั้ย") {
        speech.lang = "th-TH";
        speech.text = "รับค่ะ  สนใจทำวีซ่าประเทศไหนบอกน้องมีทัวร์ได้นะคะ";
    }
    else if (text == "รับทำวีซ่าประเทศนี้ไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "ไม่ทราบว่าคุณลูกค้าต้องการสอบถามการทำวีซ่าประเทศไหนดีคะ บอกน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าอเมริกา
    else if (text == "ขอวีซ่าอเมริกาต้องมีเงินในบัญชีเท่าไหร่") {
        speech.lang = "th-TH";
        speech.text = "ไปอเมริกา 7 วัน ควรมีเงินขั้นต่ำในบัญชี 50,000บาทค่ะคุณลูกค้า";
    }
    else if (text == "วีซ่าท่องเที่ยวขอนานแค่ไหน") {
        speech.lang = "th-TH";
        speech.text = "เวลาดำเนินการโดยประมาณคือ 4 วันทำการ ";
    }
    else if (text == "Do You Accept A Visa") {
        speech.lang = "en-US";
        speech.text = "Yes.";
    }
    else if (text == "วีซ่าอเมริกา") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเมกา") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "ประเทศอเมริกา") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "ประเทศอเมริกาค่ะ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "ประเทศอเมริกาครับ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "อเมริกา") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "อเมริกาค่ะ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "อเมริกาครับ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "เมกาค่ะ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "เมกาครับ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอเมริกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }


    //ขอวีซ่าญี่ปุ่น
    else if (text == "รับทำประเทศญี่ปุ่นไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "รับทำประเทศญี่ปุ่นไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "รับทำประเทศญี่ปุ่นไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "รับทำวีซ่าประเทศญี่ปุ่นไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "รับทำวีซ่าประเทศญี่ปุ่นไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "รับทำวีซ่าประเทศญี่ปุ่นไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "แล้วรับทำวีซ่าประเทศญี่ปุ่นไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "ประเทศญี่ปุ่นค่ะ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "ประเทศญี่ปุ่นครับ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "ประเทศญี่ปุ่น") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "ญี่ปุ่นค่ะ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "ญี่ปุ่นครับ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "ญี่ปุ่น") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า";
    }
    else if (text == "Can You do it in Japan") {
        speech.lang = "th-TH";
        speech.text = "You have a tour that doesn't accept a visa for this country,customers.";
    }

    //ขอวีซ่าไทย
    else if (text == "รับทำประเทศไทยไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "can you visa it in thailand") {
        speech.lang = "en-US";
        speech.text = "You have a tour that doesn't accept a visa for this country,customers.";
    }
    else if (text == "Can You Visa It In Thailand") {
        speech.lang = "en-US";
        speech.text = "You have a tour that doesn't accept a visa for this country,customers.";
    }

    //ขอวีซ่พม่า
    else if (text == "รับทำประเทศเมียนมาไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศเมียนมาไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศเมียนมาไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศเมียนมาร์ไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศเมียนมาร์ไหมคะ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศเมียนมาร์ไหมครับ") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "Can You do it in Myanmar") {
        speech.lang = "en-US";
        speech.text = "You have a tour that doesn't accept a visa for this country,customers.";
    }

    //ขอวีซ่าพม่า
    else if (text == "รับทำประเทศพม่าไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศกัมพูชาไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }
    else if (text == "รับทำประเทศเขมรไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าบรูไน
    else if (text == "รับทำประเทศบรูไนไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าบาห์เรน
    else if (text == "รับทำประเทศบาห์เรนไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าเวียดนาม
    else if (text == "รับทำประเทศเวียดนามไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าวานูอาตู
    else if (text == "รับทำประเทศวานูอาตูไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าตุรกี
    else if (text == "รับทำประเทศตุรกีไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าไต้หวัน
    else if (text == "รับทำประเทศไต้หวันไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์ไม่ได้รับทำวีซ่าประเทศนี้ค่ะคุณลูกค้า  สำหรับประเทศนี้ไม่ต้องขอวีซ่าสำหรับพาสปอร์ตบุคคลธรรมดาค่ะ";
    }

    //ขอวีซ่าเชงเก้น
    else if (text == "รับทำวีซ่าเชงเก้นไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่านิวซีแลนด์
    else if (text == "รับทำประเทศนิวซีแลนด์ไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าออสเตรเลีย
    else if (text == "รับทำประเทศออสเตรเลียไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าสเปน
    else if (text == "รับทำประเทศสเปนไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าโปแลนด์
    else if (text == "รับทำประเทศโปแลนด์ไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าสวิต
    else if (text == "รับทำประเทศสวิตเซอร์แลนด์ไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าสวีเดน
    else if (text == "รับทำประเทศสวีเดนไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่านอร์เวย์
    else if (text == "รับทำประเทศนอร์เวย์ไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขอวีซ่าเนเธอร์แลนด์
    else if (text == "รับทำประเทศเนเธอร์แลนด์ไหม") {
        speech.lang = "th-TH";
        speech.text = "น้องมีทัวร์รับทำวีซ่าประเทศนี้ค่ะ หากลูกค้าต้องการรายละเอียดเพิ่มเติมสามารถสอบถามน้องมีทัวร์ได้เลยนะคะ";
    }

    //ขั้นตอนการทำวีซ่า
    else if (text == "ขั้นตอนการทำวีซ่า") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "สอบถามเกี่ยวกับขั้นตอนการทำวีซ่า") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "สอบถามเกี่ยวกับขั้นตอนการทำวีซ่าค่ะ") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "สอบถามเกี่ยวกับขั้นตอนการทำวีซ่าครับ") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "จะทำวีซ่าต้องทำยังไงบ้าง") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "แล้วขั้นตอนการทำวีซ่ามียังไงบ้าง") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "ขั้นตอนการทำยังไงบ้าง") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "มีขั้นตอนยังไงบ้าง") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "ทำยังไง") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }
    else if (text == "ต้องทำยังไง") {
        speech.lang = "th-TH";
        speech.text = " 1 กรอกฟอร์มขอยื่นวีซ่า 2 ขอเอกสารทั้งหมดที่ต้องใช้ยื่นของประเทศนั้นๆ 3 นัดคิวกับ VFS จากนั้นจะแจ้งคิวลูกค้าเพื่อยื่นเอกสาร 4 ยื่นเอกสารรอผล 7 วันทำการ 5 ผลของเอกสารถูกส่งมาที่บริษัทแล้วทำการแจ้งผลให้ลูกค้า";
    }

    //ค่าใช้จ่าย
    else if (text == "ค่าใช้จ่าย") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }
    else if (text == "ค่าใช้จ่ายการทำวีซ่าต้องอะไรยังไงบ้างคะ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }
    else if (text == "ค่าใช้จ่ายการทำวีซ่าต้องอะไรยังไงบ้างครับ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }
    else if (text == "ค่าใช้จ่ายการทำวีซ่าต้องอะไรยังไงบ้าง") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }
    else if (text == "ต้องเสียเงินยังไง") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }
    else if (text == "ค่าใช้จ่ายวีซ่า") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }
    else if (text == "ค่าใช้จ่ายสำหรับทำวีซ่า") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีรายละเอียดดังนี้ค่ะ1. หากต่ำกว่า 1 เดือน ลูกค้าต้องทำวีซ่าด่วน อาจมีค่าธรรมเนียมในการเรียกเก็บเพิ่มจากสถานทูตในการทำคิวพิเศษ 2. หาก 1 เดือนขึ้นไป ค่าบริการเป็นไปตามเงื่อนไขของการเรียกเก็บจากสถานทูต ";
    }

    //ค่าใช้จ่ายฝรั่งเศส
    else if (text == "ค่าใช้จ่ายฝรั่งเศส") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }
    else if (text == "ฝรั่งเศส") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }
    else if (text == "ฝรั่งเศสค่ะ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }
    else if (text == "ฝรั่งเศสครับ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }
    else if (text == "ประเทศฝรั่งเศส") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }
    else if (text == "ประเทศฝรั่งเศสค่ะ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }
    else if (text == "ประเทศฝรั่งเศสครับ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1 ค่าธรรมเนียมสถานทูต 2,317 บาท (สำหรับเด็กอายุ 6-12 ปี 1,351 บาท) ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 2.ค่าธรรมเนียมศูนย์ TLS 1,119 บาท 3.สำหรับเด็กอายุต่ำกว่า 6 ปี ไม่เสียค่าธรรมเนียมวีซ่า แต่เสียค่าธรรมเนียมศูนย์ TLS 1,119 บาท";
    }

    //ค่าใช้จ่ายสก็อตแลนด์
    else if (text == "ค่าใช้จ่ายสก็อตแลนด์") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีค่าใช้จ่ายประมาณ 3000-5000 บาทค่ะ";
    }
    else if (text == "ค่าใช้จ่ายอังกฤษ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่า 1. ค่าบริการแบบธรรมดา  8,900 บาท (ระยะเวลาทำเอกสาร 3-5 วันทำการ + ระยะเวลาในการพิจารณาวีซ่า UK  15 วัน) 2. ค่าบริการแบบพิเศษ (รับรอง)  15,000 บาท (ระยะเวลาทำเอกสาร 3 วันทำการ + ระยะเวลาในการพิจารณาวีซ่า UK 15 วัน) 3. ค่าบริการเสริม ทำแบบเร่งด่วน 5 วันรู้ผลวีซ่า คิดเพิ่มประมาณ 8,800 บาท ( ชำระกับทางสถานทูต )";
    }
    else if (text == "ค่าใช้จ่ายเมกา") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีค่าใช้จ่ายประมาณ 5000 - 7000 บาทค่ะ";
    }
    else if (text == "ค่าใช้จ่ายอเมริกา") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีค่าใช้จ่ายประมาณ 5000 - 7000 บาทค่ะ";
    }
    else if (text == "ค่าใช้จ่าย USA") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีค่าใช้จ่ายประมาณ 5000 - 7000 บาทค่ะ";
    }
    else if (text == "ค่าใช้จ่ายแคนาดา") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีค่าใช้จ่ายประมาณ  3000 - 4000 บาทค่ะ";
    }
    else if (text == "ค่าใช้จ่ายไอร์แลนด์เหนือ") {
        speech.lang = "th-TH";
        speech.text = " น้องมีทัวร์ขอแจ้งสำหรับอัตราค่าธรรมเนียมในการทำวีซ่ามีค่าใช้จ่ายประมาณ  2700-4200 บาทค่ะ";
    }
    else if (text == "วีซ่าจีน") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศจีนลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่านอร์เวย์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศนอร์เวย์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่านิวซีเเลนด์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศนิวซีเเลนด์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าฟินแลนด์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศฟินแลนด์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่ายุโรป") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศยุโรปลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าสก็อตแลนด์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศสก็อตแลนด์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าสวิตเซอร์แลนด์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศสวิตเซอร์แลนด์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าสวีเดน") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศสวีเดนลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าสเปน") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศสเปนลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าออสเตรีย") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศออสเตรียลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าอังกฤษ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอังกฤษลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าอินเดีย") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศอินเดียลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าฮังการี") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศฮังกาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเชงเก้น") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเชงเก้นลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเดนมาร์ก") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเดนมาร์กลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเนเธอร์แลนด์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเนเธอร์แลนด์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเบลเยียม") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเบลเยียมลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเยอรมนี") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเยอรมนีลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเยอรมัน") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเยอรมันลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเวลส์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเวลส์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าเอเชีย") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศเอเชียลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าแคนดา") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศแคนดาลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าโปแลนด์") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศโปแลนด์ลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "วีซ่าไอร์แลนด์เหนือ") {
        speech.lang = "th-TH";
        speech.text = " สำหรับประเทศไอร์แลนด์เหนือลูกค้าต้องเตรียมเอกสารเบื้องต้น ดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }

    //เอกสาร
    else if (text == "เอกสาร") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "เอกสารที่ต้องใช้สำหรับทำวีซ่า") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "เอกสารที่ต้องใช้ทำวีซ่า") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "เอกสารต้องเตรียมอะไรบ้าง") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "แล้วต้องใช้เอกสารอะไรบ้าง") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "แล้วต้องใช้เอกสารอะไรบ้างคะ") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }
    else if (text == "แล้วต้องใช้เอกสารอะไรบ้างครับ") {
        speech.lang = "th-TH";
        speech.text = " เอกสารสำหรับการทำวีซ่าลูกค้าต้องเตรียมดังนี้ค่ะ สำเนาบัตรประชาชน สำเนาเปลี่ยนชื่อ-สกุล(ถ้ามี) statement ย้อนหลัง 6 เดือน สำเนาทะเบียนบ้าน ใบรับรองการทำงาน โปรแกรมทัวร์ สำเนาพาสปอร์ต หนังสือรับรองทางการเงินออกโดยธนาคาร ข้อมูลที่พัก ";
    }

    //คำถามวีซ่าทั่วไป
    else if (text == "เด็กจำเป็นต้องยื่นขอวีซ่าหรือไม่") {
        speech.lang = "th-TH";
        speech.text = " หากว่าเด็กได้กระทำการขอยื่นวีซ่าโดยใช้ชื่อตนเองเพียงชื่อเดียว จะต้องกรอกเเบบฟอร์มการยื่นขอวีซ่าเพียงชุดเดียว เเต่ถ้าเด็กได้กระทำการขอยื่นวีซ่าโดยมีผู้ร่วมหรือมีหนังสือเดินทางร่วมกัน ไม่จำเป็นต้องกรอกเอกสารเเยกชุด ";
    }
    else if (text == "ถ้าข้อมูลในหนังสือเดินทางและวีซ่าไม่ถูกต้องจะต้องทำอย่างไรบ้าง") {
        speech.lang = "th-TH";
        speech.text = " หลังจากที่คุณได้เอกสารวีซ่าเเล้วพบว่าข้อมูลนั้นไม่ถูกต้อง กรุณาติดต่อเจ้าพนักงานทางโทรศัพท์หรือติดต่อโดยตรงที่ศูนย์วีซ่า ";
    }
    else if (text == "อะไรคือเหตุผลที่ทำให้การขอวีซ่าของเราถูกปฏิเสธ") {
        speech.lang = "th-TH";
        speech.text = " โดยทั่วไปแล้ว ก็คือ นักเรียนที่ไม่แสดงหลักฐานทางการเงินที่ถูกต้อง  พวกเขาจะมีจำนวนตัวเลขรวมที่ถูกต้อง แต่ว่ากลับไม่เขียนมาในรูปแบบหรือการรับรองอย่างถูกต้องซึ่งการแสดงหลักฐานนี้ไม่ได้ผลเสมอไป  เพราะบางครั้งนักเรียนก็เชื่อว่าถ้าพวกเขาแสดงหลักฐานทางการเงินจากญาติที่มีความร่ำรวยก็เพียงพอแล้ว  ซึ่งจึงๆแล้วไม่ใช่  ดังนั้น จึงจำเป็นมากในการดูว่าหลักฐานประเภทไหนที่เขารับรองและควรแสดงเฉพาะหลักฐานเหล่านั้นเท่านั้น ";
    }
    else {
        speech.lang = "th-TH";
        speech.text = "พูดอีกทีได้ไหมคะ"
    }

    document.getElementById("res").innerHTML = speech.text;
    
    window.speechSynthesis.speak(speech);
}